''' № 1
Розробіть функцію get_days_from_today(date), яка повертатиме кількість днів від поточної дати, де параметр date - це рядок формату '2020-10-09' (рік-місяць-день).
Підказки:
Параметр date розбити на рік, місяць та день можна використовуючи метод рядків split.
datetime приймає аргументи типу int, використовуйте перетворення типів.
ігноруйте години, хвилини та секунди для вашої дати, важливі повні дні.
кількість днів ви можете отримати відніманням з поточної дати, заданої в змінній date (без часу).
Наприклад: Якщо поточна дата - '5 травня 2021', то виклик get_days_from_today("2021-10-09") поверне нам -157.
'''
# from datetime import datetime

# def get_days_from_today(date):
#     datetime_now = datetime.now()
    
#     date_datetime = datetime.strptime(date, '%Y-%m-%d')
    
#     time_delta = (datetime_now-date_datetime).days
   
#     return time_delta

# print(get_days_from_today('2020-10-09'))

''' № 2
Напишіть функцію визначення кількості днів у конкретному місяці. Ваша функція повинна приймати два параметри: month - номер місяця у вигляді цілого числа в діапазоні від 1 до 12 і year - рік, що складається із чотирьох цифр. Перевірте, чи функція коректно обробляє місяць лютий високосного року.
'''
from datetime import date

def get_days_in_month(month, year):
    

print(get_days_in_month(2, 2000))